<h1>Base de Datos 2</h1>

<h2>Sentencias <code>SELECT</code></h2>

<h3>Creaci√≥n de las Tablas</h3>
<p>A continuaci√≥n, vamos a crear las tablas que nos servir√°n de ejemplo para realizar los ejercicios de estos apuntes.</p>
<p>Realizamos la conexi√≥n a nuestra base de datos SQLITE, que se encuentra en memoria.</p>

In [1]:
%load_ext sql

# Conectarse a una base de datos SQLite en memoria
%sql sqlite:///:memory:

<h5>1. Creamos una Tabla llamada <code>CLIENTES</code></h5>

In [2]:
%%sql
CREATE TABLE Clientes (
    cliente_id INTEGER PRIMARY KEY,
    nombre VARCHAR(50),
    apellido VARCHAR(50),
    pais VARCHAR(50),
    edad INTEGER
);

 * sqlite:///:memory:
Done.

[]


<p><b>Explicaci√≥n:</b></p>
<ul>
<li><b>cliente_id:</b> Identificador √∫nico para cada cliente.</li>
<li><b>nombre:</b> Nombre del cliente.</li>
<li><b>apellido:</b> Apellido del cliente.</li>
<li><b>pais:</b> Pa√≠s de origen del cliente.</li>
<li><b>edad:</b> Edad del cliente.</li>
</ul>

<h5>2. Creamos la Tabla <code>PEDIDOS</code></h5>

In [3]:
%%sql
CREATE TABLE Pedidos (
    pedido_id INT PRIMARY KEY,
    fecha DATE,
    producto VARCHAR(50),
    cantidad INT,
    cliente_id INT,
    pendiente BOOLEAN,
    FOREIGN KEY (cliente_id) REFERENCES Clientes(cliente_id)
);

 * sqlite:///:memory:
Done.

[]


<p><b>Explicaci√≥n:</b></p>
<ul>
<li><b>pedido_id:</b> Identificador √∫nico para cada pedido.</li>
<li><b>producto:</b> El producto comprado.</li>
<li><b>cantidad:</b> Cantidad del producto en el pedido.</li>
<li><b>cliente_id:</b> Relaci√≥n con el cliente (FK que referencia a la tabla Clientes).</li>
<li><b>pendiente:</b> Si el pedido est√° pendiente (TRUE) o no (FALSE).</li>
</ul>

<h5>3. Creamos la Tabla <code>Empleados</code></h5>

In [4]:
%%sql
CREATE TABLE Empleados (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    nombre TEXT NOT NULL,
    departamento TEXT NOT NULL,
    salario REAL NOT NULL,
    correo TEXT
);

 * sqlite:///:memory:
Done.

[]

<h5>Comprobamos si se han creado correctamente</h5>

In [5]:
%sql SELECT * FROM Clientes;

 * sqlite:///:memory:
Done.

[]

In [6]:
%sql SELECT * FROM Pedidos;

 * sqlite:///:memory:
Done.

[]

In [7]:
%sql SELECT * FROM Empleados;

 * sqlite:///:memory:
Done.

[]


<h2>2. Inserci√≥n de Datos en las Tablas</h2>

<h3>2.1. Sentencia <code>INSERT INTO</code></h3>
<p>La sentencia <code>INSERT INTO</code> se utiliza para a√±adir nuevos registros en una tabla existente. A continuaci√≥n, se muestra la sintaxis general:</p>

<pre><code>INSERT INTO nombre_de_la_tabla (campo1, campo2, ..., campoN)
VALUES (valor1, valor2, ..., valorN);</code></pre>

<p><b>Explicaci√≥n de la Sintaxis:</b></p>
<ul>
    <li><b>nombre_de_la_tabla:</b> El nombre de la tabla donde se insertar√°n los datos.</li>
    <li><b>campo1, campo2, ..., campoN:</b> Los nombres de los campos en los que se insertar√°n los valores.</li>
    <li><b>valor1, valor2, ..., valorN:</b> Los valores que se van a insertar en las columnas correspondientes de la tabla.</li>
</ul>

<h3>2.2. Ejemplo de Inserci√≥n de Datos</h3>

<h3>Insertamos datos en la tabla <b>Clientes</b>:</h3>

In [8]:
%%sql
INSERT INTO Clientes (cliente_id, nombre, apellido, pais, edad) VALUES
(1, 'Juan', 'P√©rez', 'Espa√±a', 30),
(2, 'Ana', 'Garc√≠a', 'M√©xico', 25),
(3, 'Luis', 'Mart√≠nez', 'Argentina', 35),
(4, NULL, NULL,NULL, NULL),
(5, 'Carlos', 'Gonz√°lez', 'Colombia', 40),
(6, 'Laura', 'Fern√°ndez', 'Chile', 22),
(7, 'Pedro', 'S√°nchez', 'Espa√±a', 31),
(8, 'Jhon', 'Doe', 'Reino Unido', 29),
(9, 'Isabel', 'N√∫√±ez', 'M√©xico', 26),
(10, 'Miguel', 'Romero', 'Per√∫', 33);

 * sqlite:///:memory:
10 rows affected.

[]

<p>Comprobamos si se han insertado correctamente</p>

In [9]:
%sql SELECT * FROM Clientes;

 * sqlite:///:memory:
Done.

[(1, 'Juan', 'P√©rez', 'Espa√±a', 30),
 (2, 'Ana', 'Garc√≠a', 'M√©xico', 25),
 (3, 'Luis', 'Mart√≠nez', 'Argentina', 35),
 (4, None, None, None, None),
 (5, 'Carlos', 'Gonz√°lez', 'Colombia', 40),
 (6, 'Laura', 'Fern√°ndez', 'Chile', 22),
 (7, 'Pedro', 'S√°nchez', 'Espa√±a', 31),
 (8, 'Jhon', 'Doe', 'Reino Unido', 29),
 (9, 'Isabel', 'N√∫√±ez', 'M√©xico', 26),
 (10, 'Miguel', 'Romero', 'Per√∫', 33)]


<h3>Insertamos datos en la tabla <b>Pedidos</b>:</h3>

In [10]:
%%sql
INSERT INTO Pedidos (pedido_id, fecha, producto, cantidad, cliente_id, pendiente) VALUES
(1, '10-10-2024', 'Teclado', 5, 1, FALSE),
(2, '11-10-2024', 'Rat√≥n', 3, 2, TRUE),
(3, '12-10-2024', 'Teclado', 4, 3, FALSE),
(4, '13-10-2024', 'Rat√≥n', 2, NULL, TRUE),
(5, '14-10-2024', 'Monitor', 1, 5, FALSE),
(6, '15-10-2024', 'Teclado', 2, 6, TRUE),
(7, '16-10-2024', 'Rat√≥n', 4, 7, FALSE),
(8, '17-10-2024', 'Teclado', 3, 8, TRUE),
(9, '18-10-2024', 'Monitor', 2, 9, FALSE),
(10, '19-10-2024', 'Rat√≥n', 5, 10, TRUE);

 * sqlite:///:memory:
10 rows affected.

[]

<p>Comprobamos si se han insertado correctamente</p>

In [11]:
%sql SELECT * FROM Pedidos;

 * sqlite:///:memory:
Done.

[(1, '10-10-2024', 'Teclado', 5, 1, 0),
 (2, '11-10-2024', 'Rat√≥n', 3, 2, 1),
 (3, '12-10-2024', 'Teclado', 4, 3, 0),
 (4, '13-10-2024', 'Rat√≥n', 2, None, 1),
 (5, '14-10-2024', 'Monitor', 1, 5, 0),
 (6, '15-10-2024', 'Teclado', 2, 6, 1),
 (7, '16-10-2024', 'Rat√≥n', 4, 7, 0),
 (8, '17-10-2024', 'Teclado', 3, 8, 1),
 (9, '18-10-2024', 'Monitor', 2, 9, 0),
 (10, '19-10-2024', 'Rat√≥n', 5, 10, 1)]


<h3>Insertamos datos en la tabla <b>Empleados</b>:</h3>

In [12]:
%%sql
INSERT INTO Empleados (nombre, departamento, salario, correo) VALUES 
('Ana', 'Ventas', 3500, 'ana@empresa.com'),
('Luis', 'Ventas', 4200, 'luis@empresa.com'),
('Mar√≠a', 'Marketing', 5000, 'maria@empresa.com'),
('Carlos', 'Marketing', 4800, 'carlos@empresa.com'),
('Laura', 'IT', 6000, 'laura@empresa.com'),
('Jorge', 'IT', 6200, 'jorge@empresa.com'),
('Sof√≠a', 'Ventas', 3900, NULL),
('Ra√∫l', 'Recursos Humanos', 3700, 'raul@empresa.com'),
('Elena', 'Recursos Humanos', 4100, NULL),
('Marta', 'IT', 5700, 'marta@empresa.com');

 * sqlite:///:memory:
10 rows affected.

[]

<p>Comprobamos si se han insertado correctamente</p>

In [13]:
%sql SELECT * FROM Empleados;

 * sqlite:///:memory:
Done.

[(1, 'Ana', 'Ventas', 3500.0, 'ana@empresa.com'),
 (2, 'Luis', 'Ventas', 4200.0, 'luis@empresa.com'),
 (3, 'Mar√≠a', 'Marketing', 5000.0, 'maria@empresa.com'),
 (4, 'Carlos', 'Marketing', 4800.0, 'carlos@empresa.com'),
 (5, 'Laura', 'IT', 6000.0, 'laura@empresa.com'),
 (6, 'Jorge', 'IT', 6200.0, 'jorge@empresa.com'),
 (7, 'Sof√≠a', 'Ventas', 3900.0, None),
 (8, 'Ra√∫l', 'Recursos Humanos', 3700.0, 'raul@empresa.com'),
 (9, 'Elena', 'Recursos Humanos', 4100.0, None),
 (10, 'Marta', 'IT', 5700.0, 'marta@empresa.com')]



<h2>Consultas SQL</h2>
<h2>3. Consultas SQL B√°sicas</h2>

<h3>3.1. Sentencia <code>SELECT</code></h3>
<p>La sentencia <code>SELECT</code> se utiliza para recuperar datos de una o m√°s tablas. A continuaci√≥n se presenta la sintaxis b√°sica:</p>

<pre><code>SELECT campo1, campo2, ..., campoN
FROM nombre_de_la_tabla
WHERE condici√≥n
ORDER BY campo1 [ASC|DESC];</code></pre>

<p><b>Explicaci√≥n de la Sintaxis:</b></p>
<ul>
    <li><b>campo1, campo2, ..., campoN:</b> Los nombres de las columnas que se desean consultar.</li>
    <li><b>nombre_de_la_tabla:</b> El nombre de la tabla de la que se extraer√°n los datos.</li>
    <li><b>condici√≥n (opcional):</b> Un criterio que filtra los datos que se van a seleccionar. Si se omite, se seleccionan todos los registros.</li>
    <li><b>ORDER BY (opcional):</b> Permite ordenar los resultados en base a una columna. Se puede especificar si se desea en orden ascendente (<code>ASC</code>) o descendente (<code>DESC</code>).</li>
</ul>

<h3>3.2. Ejemplo de Consulta</h3>
<p>A continuaci√≥n, se muestra un ejemplo que selecciona todos los nombres de la tabla <code>Clientes</code> donde la edad es mayor a 25 a√±os, ordenados por edad en orden descendente:</p>

In [14]:
%%sql
SELECT nombre, edad
FROM Clientes
WHERE edad > 25
ORDER BY edad DESC;

 * sqlite:///:memory:
Done.

[('Carlos', 40),
 ('Luis', 35),
 ('Miguel', 33),
 ('Pedro', 31),
 ('Juan', 30),
 ('Jhon', 29),
 ('Isabel', 26)]


<p><b>Explicaci√≥n del Ejemplo:</b></p>
<ul>
    <li><b>nombre, edad:</b> Se seleccionan las columnas <code>nombre</code> y <code>edad</code> de la tabla <code>Clientes</code>.</li>
    <li><b>edad > 25:</b> Filtra los registros donde la columna <code>edad</code> sea mayor a 25 a√±os.</li>
    <li><b>ORDER BY edad DESC:</b> Ordena los resultados en orden descendente seg√∫n la columna <code>edad</code>.</li>
</ul>

En SQL, existen funciones agregadas como <code>AVG, SUM, COUNT, MAX, y MIN</code> que son √∫tiles para realizar c√°lculos y obtener estad√≠sticas de los datos en una tabla. Aqu√≠ te explico cada una de ellas:

1. <code>AVG (Average)</code> Calcula el promedio de los valores en una columna num√©rica. Ejemplo:

In [ ]:
%%sql
SELECT AVG(salario) FROM empleados;


<p>Este ejemplo calcula el salario promedio de todos los empleados en la tabla empleados.</p>

2. <code>SUM</code> Calcula la suma total de los valores en una columna num√©rica.
Ejemplo:

In [ ]:
%%sql
SELECT SUM(salario) FROM empleados;

<p>Esta sentencia suma todos los salarios en la columna salario de la tabla empleados.</p>

3. <code>COUNT</code> Cuenta el n√∫mero de filas en un conjunto de resultados. Puede contar todas las filas o solo las filas no nulas de una columna espec√≠fica. Ejemplo:

In [ ]:
%%sql
SELECT COUNT(*) FROM empleados;

<p>Aqu√≠ se cuenta el total de filas en la tabla empleados.</p>
<p>Para contar solo valores no nulos en una columna:</p>

In [ ]:
%%sql
SELECT COUNT(correo) FROM empleados;

4. <code>MAX</code> Devuelve el valor m√°ximo de una columna, ya sea num√©rica o alfab√©tica.Ejemplo:

In [ ]:
%%sql
SELECT MAX(salario) FROM empleados;

<p>Este ejemplo devuelve el salario m√°s alto en la tabla empleados.</p>

5. <code>MIN</code> Devuelve el valor m√≠nimo de una columna, ya sea num√©rica o alfab√©tica. Ejemplo:

In [ ]:
%%sql
SELECT MIN(salario) FROM empleados;

Esto devuelve el salario m√°s bajo en la tabla empleados.

Combinando funciones agregadas con <code>GROUP BY</code>. Las funciones agregadas pueden usarse junto con <code>GROUP BY</code> para realizar c√°lculos en grupos de datos. Ejemplo:

In [ ]:
%%sql
SELECT departamento, AVG(salario) FROM empleados GROUP BY departamento;


<p>Este ejemplo calcula el salario promedio por cada departamento en la tabla empleados.</p>

<p>Resumen:</p>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>SQL Functions Summary</title>
    <style>
        /* Estilos generales */
        body {
            font-family: Arial, sans-serif;
            background: #f7f7f7;
            display: flex;
            justify-content: center;
            align-items: center;
            height: 100vh;
            margin: 0;
        }
        .container {
            display: flex;
            gap: 15px;
        }
        /* Tarjetas de resumen */
        .card {
            width: 120px;
            padding: 20px;
            background: #fff;
            box-shadow: 0 4px 8px rgba(0, 0, 0, 0.2);
            border-radius: 8px;
            text-align: center;
            transition: transform 0.3s;
        }
        .card:hover {
            transform: translateY(-10px);
        }
        /* Estilos de los √≠conos */
        .icon {
            font-size: 40px;
            margin-bottom: 10px;
            color: #4A90E2;
        }
        .description {
            font-weight: bold;
            color: #333;
            margin-top: 8px;
            font-size: 14px;
        }
        /* Animaci√≥n */
        @keyframes bounce {
            0%, 100% {
                transform: translateY(0);
            }
            50% {
                transform: translateY(-10px);
            }
        }
        .card:hover .icon {
            animation: bounce 0.5s;
        }
    </style>
</head>
<body>

<div class="container">
    <div class="card">
        <div class="icon">üìä</div>
        <div class="description">AVG</div>
        <p>Calcula el promedio</p>
    </div>
    <div class="card">
        <div class="icon">‚ûï</div>
        <div class="description">SUM</div>
        <p>Suma todos los valores</p>
    </div>
    <div class="card">
        <div class="icon">üî¢</div>
        <div class="description">COUNT</div>
        <p>Cuenta las filas</p>
    </div>
    <div class="card">
        <div class="icon">‚¨ÜÔ∏è</div>
        <div class="description">MAX</div>
        <p>Encuentra el valor m√°ximo</p>
    </div>
    <div class="card">
        <div class="icon">‚¨áÔ∏è</div>
        <div class="description">MIN</div>
        <p>Encuentra el valor m√≠nimo</p>
    </div>
</div>

</body>
</html>

<p>Estas funciones son muy √∫tiles para obtener estad√≠sticas y an√°lisis de datos en SQL.</P>

<h3>Uso de Alias en la Sentencia <code>SELECT</code></h3>
<p>Un <strong>alias</strong> en la sentencia <code>SELECT</code> permite renombrar temporalmente una columna o tabla en una consulta SQL, lo cual hace los resultados m√°s legibles o simplifica referencias complejas.</p>

<h4>Alias para Columnas</h4>
<p>Para asignar un alias a una columna, se usa la palabra clave <code>AS</code> (aunque algunos sistemas lo permiten sin <code>AS</code>). Este alias aparecer√° como encabezado de columna en los resultados.</p>

In [ ]:
%%sql
SELECT nombre AS NombreCliente, salario AS SalarioAnual
FROM empleados;

<p>Sin <code>AS</code></p>

In [ ]:
%%sql
SELECT nombre NombreCliente, salario SalarioAnual
FROM empleados;


<p>En estos ejemplos:</p>
<ul>
    <li><code>nombre</code> se renombra como <strong>NombreCliente</strong>.</li>
    <li><code>salario</code> se renombra como <strong>SalarioAnual</strong>.</li>
</ul>


<h4>Alias para Tablas</h4>
<p>Los alias de tabla se utilizan para abreviar nombres de tablas, especialmente cuando se hace referencia a varias tablas en consultas complejas, como las uniones (<code>JOIN</code>), que veremos m√°s adelante. Se colocan despu√©s del nombre de la tabla y se usan en el resto de la consulta para referirse a esa tabla.</p>

In [ ]:
%%sql
SELECT c.nombre AS Cliente, p.fecha AS FechaPedido
FROM Clientes AS c
JOIN Pedidos AS p ON c.cliente_id = p.cliente_id;

<p>Sin <code>AS</code></p>

In [ ]:
%%sql
SELECT c.nombre Cliente, p.fecha FechaPedido
FROM Clientes c
JOIN Pedidos p ON c.cliente_id = p.cliente_id;


<p>En este ejemplo:</p>
<ul>
    <li><code>Clientes</code> se renombra como <strong>c</strong>.</li>
    <li><code>Pedidos</code> se renombra como <strong>p</strong>.</li>
</ul>

<p>Estos alias hacen que el c√≥digo sea m√°s conciso y f√°cil de leer.</p>

<h3>Cl√°usula <code>WHERE</code> en SQL</h3>
    <p>La cl√°usula <code>WHERE</code> en una consulta <code>SELECT</code> filtra los resultados seg√∫n una o m√°s condiciones. Solo se mostrar√°n las filas que cumplan con estas condiciones.</p>
    
   <h4>1. Igualdad <code>=</code></h4>
    <p>Filtra filas donde el valor de la columna es igual a un valor espec√≠fico.</p>
    <p class="example">Ejemplo:</p>

In [ ]:
%%sql
SELECT * FROM Clientes WHERE pais = 'Espa√±a';


   <h4>2. Desigualdad, distindo de <code>!=</code> o <code>&lt;&gt;</code></h4>
    <p>Selecciona filas donde el valor de la columna es distinto de un valor espec√≠fico.</p>
    <p>Ejemplo: </p>

In [ ]:
%%sql
SELECT * FROM Empleados WHERE salario != 5000;


   <h4>3. Comparaciones <code>&gt;</code>, <code>&gt;=</code>, <code>&lt;</code> y <code>&lt;=</code></h4>
    <p>Filtra filas bas√°ndose en un valor num√©rico o de fecha que sea mayor o menor al valor indicado.</p>
    <p>Ejemplo: </p>
    <h5> Mayor que 3</h5>

In [ ]:
%%sql
SELECT * FROM Pedidos WHERE cantidad>3;

<h5> Menor e igual que 3</h5>

In [ ]:
%%sql
SELECT * FROM Pedidos WHERE cantidad<=3;

 <h5> Menor que la fecha 16-10-2024</h5>

In [ ]:
%%sql
SELECT * FROM Pedidos WHERE fecha<"16-10-2024";


   <h4>4. Entre Rango <code>BETWEEN</code></h4>
    <p>Selecciona filas donde el valor de una columna est√° entre dos valores, incluidos ambos l√≠mites.</p>
    <p>Ejemplo: </p>

In [ ]:
%%sql
SELECT * FROM Empleados WHERE salario BETWEEN 3000 AND 5000;

   <h4>5. En Lista <code>IN</code></h4>
    <p>Filtra filas cuyo valor coincide con cualquiera en una lista dada.</p>
    <p>Ejemplo: </p>

In [ ]:
%%sql
SELECT * FROM Empleados WHERE departamento IN ('Ventas', 'Marketing');


   <h4>6. Valor Nulo <code>IS NULL</code></h4>
    <p>Selecciona filas donde el valor de la columna es nulo.</p>
    <p>Ejemplo: </p>

In [ ]:
%%sql
SELECT * FROM pedidos WHERE cliente_id IS NULL;

<div style="text-align: center;">
    <img src="imagenes/like-sql-datascientest.png" alt="Patr√≥n de B√∫squeda LIKE" style="width: 50%;" />
</div>   
   <h4>7. Patr√≥n de B√∫squeda <code>LIKE</code></h4>

   <p>La cl√°usula <code>LIKE</code> se utiliza en SQL para buscar valores en una columna que coincidan con un patr√≥n espec√≠fico. Puedes emplear comodines para definir estos patrones:</p>
    <h4>1. Comod√≠n <code>%</code></h4>
    <p>El s√≠mbolo <code>%</code> representa cualquier secuencia de caracteres (incluyendo ninguna). Puedes usarlo en diferentes posiciones en el patr√≥n.</p>
    <p>Ejemplo: </p>
    <p>Esta sentencia buscar√° todos los nombres que empiezan con "A".</p>

In [ ]:
%%sql
SELECT * FROM clientes WHERE nombre LIKE 'A%';

   <h4>2. Comod√≠n <code>_</code></h4>
    <p>El gui√≥n bajo <code>_</code> representa <b style="color:blue;">un √∫nico car√°cter</b> en cualquier posici√≥n del patr√≥n.</p>
    <p>Ejemplo:</p> 
    <p>Esta sentencia buscar√° todos los registros que empiecen por "R", seguido de cualquier car√°cter, seguido de "t", seguido de dos caracteres m√°s.</p>

In [ ]:
%%sql
SELECT * FROM Pedidos WHERE producto LIKE 'R_t__';

   <h4>3. Uso Combinado de <code>%</code> y <code>_</code></h4>
    <p>Se pueden combinar ambos comodines para patrones m√°s espec√≠ficos.</p>
    <p>Ejemplo:</p> 
    <p>Esta sentencia buscar√° todos los registros que teempiecen por "T", seguido de cualquier car√°cter, seguido de "c", seguido de cualquier car√°cter m√°s.</p>

In [ ]:
%%sql
SELECT * FROM Pedidos WHERE producto LIKE 'T_c%';

   <h4>4. Caracteres entre Rango <code>[ ]</code></h4>
    <p>Los corchetes <code>[ ]</code> se usan para especificar un rango o conjunto de caracteres v√°lidos en esa posici√≥n.
    <br>
    <b style="color:red;">(No siempre est√° disponible en todos los sistemas SQL)</b>.</p>
    <p>
        <p>Ejemplo:</p> 
        Esta sentencia buscar√° nombres que empiezan con una vocal.</p>

In [ ]:
%%sql
SELECT * FROM Empleados WHERE nombre LIKE '[AEIOU]%';

<p>En SQLite, los patrones de coincidencia con corchetes <code>[ ]</code> para rangos o conjuntos de caracteres (como [AEIOU]) no son compatibles. Una opci√≥n para esta sentencia ser√≠a:</p>

In [ ]:
%%sql
SELECT * FROM Empleados WHERE 
    nombre LIKE 'A%' OR 
    nombre LIKE 'E%' OR 
    nombre LIKE 'I%' OR 
    nombre LIKE 'O%' OR 
    nombre LIKE 'U%';

   <h4>5. Exclusi√≥n de Caracteres con <code>[^]</code> o <code>[!]</code></h4>
    <p>Los s√≠mbolos <code>[^]</code> o <code>[!]</code> permiten excluir caracteres en la posici√≥n especificada.</p>
    <p>
        <p>Ejemplo:</p>
        <p>Esta sentencia seleccionar√° nombres que no empiecen con un n√∫mero.</p>

In [ ]:
%%sql
SELECT * FROM Empleados WHERE nombre LIKE '[!0-9]*';

<p><b style="color:red;">SQLite no soporta el uso de esta expresi√≥n.</b></p>

<h4>6. Patr√≥n de b√∫squeda <code>NOT LIKE</code></h4>

<P>Hasta ahora te he mostrado resultados con una b√∫squeda positiva o, lo que es lo mismo, los resultados que coinciden con el patr√≥n.

¬øPero y si quieres justo lo contrario?

Para esto usar√°s el operador NOT que, como siempre, se vuelve TRUE cuando el resultado es el contrario de la condici√≥n que le sigue.</P>

<P>Ejemplo </P>
<P>Empleados con un nombre con una longuitud distinta de 4 letras y de 5 letras:</P>

In [80]:
%%sql
SELECT * FROM Empleados WHERE nombre NOT LIKE '____' AND nombre NOT LIKE '_____';

 * sqlite:///:memory:
Done.

[(1, 'Ana', 'Ventas', 3500.0, 'ana@empresa.com'),
 (4, 'Carlos', 'Marketing', 4800.0, 'carlos@empresa.com')]